// Написать программу, которая выводитслучайное число из отрезка [10,99] и показываетнаибольшую цифру числа
// Пример 78->8  12->2  85->8

Console.Clear();
Console.WriteLine("Введите целое число больше 2: ");
int N = Convert.ToInt32(Console.ReadLine());