// YНаписать программу которая выводит случайное трёхзначное число и удаляет вторую цифру этого числа
// Пример 45->46  782->72  918->98

Console.Clear();
Console.WriteLine("Введите целое число больше 2: ");
int N = Convert.ToInt32(Console.ReadLine());
