// Написать программу, которая принимает на вхлодьдва числа и проверяет, является ли одно квадратом другого.
// 5,25->да  -4,16->да  25,5->да  8,9->нет

Console.Clear();
Console.WriteLine("Введите целое число больше 2: ");
int N = Convert.ToInt32(Console.ReadLine());
