// Написать программу, которая на вход принимает число и проверяет, кротно ли оно однавременно 7 и 23
// Пример 14->нет    46->нет   161->да

Console.Clear();
Console.WriteLine("Введите целое число больше 2: ");
int N = Convert.ToInt32(Console.ReadLine());