// Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
// M = 1; N = 5 -> "1, 2, 3, 4, 5"
// M = 4; N = 8 -> "4, 5, 6, 7, 8"

Console.Clear();
void Natural(int M, int N)
{
    // Console.WriteLine(M);
    Console.Write($"{M}, ");
    if (M < N)
    {
        Natural(M + 1, N);
    }
}

Console.Write("Введите M: ");
int M = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите N: ");
int N = Convert.ToInt32(Console.ReadLine());

Natural(M,N);
