// Написать программу, которая будет принимать на вход два числа и выводить, является ли второе числократным первому. Если число 2 не кратно числу 1, то программа выводит остаток от деления.
// Пример  34,5-> не кратно, остаток 4  16,4 -> кратно

Console.Clear();
Console.WriteLine("Введите целое число больше 2: ");
int N = Convert.ToInt32(Console.ReadLine());